EnJens/micropython/ports/efm32/boards/thule/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "thule"
#define MICROPY_HW_MCU_NAME "efr32mg21p"

